In [6]:
import numpy as np
import pandas as pd

In [3]:
data = {'NOMBRE':['Maria','Jose','David','Ivan'],
        'CARRERA':['auditoria','informatica','Derecho','Idiomas'],
        'CORREO':['corre1@gmail.com','corre2@gmail.com','corre3@gmail.com','corre4@gmail.com']}

In [4]:
estudiantes = pd.DataFrame(data)

In [5]:
estudiantes

  NOMBRE      CARRERA            CORREO
0  Maria    auditoria  corre1@gmail.com
1   Jose  informatica  corre2@gmail.com
2  David      Derecho  corre3@gmail.com
3   Ivan      Idiomas  corre4@gmail.com

In [8]:
df = pd.DataFrame([['Maria',27],['Jose',25],['David',23],['Ivan',25]],columns=['NOMBRE','EDAD'])

In [10]:
df

  NOMBRE  EDAD
0  Maria    27
1   Jose    25
2  David    23
3   Ivan    25

In [16]:
df = pd.DataFrame([np.arange(10)*10,np.arange(10)*50],['EDADES', 'NOTAS'])

In [17]:
df

        0   1    2    3    4    5    6    7    8    9
EDADES  0  10   20   30   40   50   60   70   80   90
NOTAS   0  50  100  150  200  250  300  350  400  450

In [21]:
df = pd.DataFrame(np.random.randn(4,3), columns=['a','b','c'])

In [22]:
df

          a         b         c
0 -0.052923  1.150312 -0.231357
1  0.043147 -1.837514 -0.844421
2 -0.732080  1.270387  1.023900
3 -1.323514 -0.529186 -0.659207